In [1]:
import pandas as pd
import os

estados: Florida, Pennsylvania, Tennessee, California, Texas, New York

In [22]:
#df_estados_USA= pd.read_csv("D:/PROYECTO FINAL/Google Maps/estados_usa.csv",delimiter = ';', encoding = "utf-8")
df_estados_USA= pd.read_csv("C:/Data/GMaps/estados_usa.csv",delimiter = ';', encoding = "utf-8")

In [23]:
df_estados_USA= df_estados_USA.rename(columns={'nombre_largo': 'estado', 'nombre_corto':'state'}) # cambiar nombre de la columna
df_estados_USA= df_estados_USA.drop(['codigos'], axis=1) 
df_estados_USA['estado']= df_estados_USA['estado'].convert_dtypes(convert_string=True)
df_estados_USA['estado']= df_estados_USA['estado'].str.strip()  # quita los espacios vacios

In [24]:
df_estados_USA.head()

       estado state
0     Alabama    AL
1      Alaska    AK
2     Arizona    AZ
3    Arkansas    AR
4  California    CA

In [112]:
#df_business = pd.read_pickle("D:/PROYECTO FINAL/Yelp/business.pkl")
df_business = pd.read_pickle("C:/Data/Yelp/business.pkl")
df_business = df_business.loc[:, ~df_business.columns.duplicated()]

In [82]:
df_business.info()

<class 'pandas.core.frame.DataFrame'>
Index: 150346 entries, 0 to 150345
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   business_id   150346 non-null  object
 1   name          150346 non-null  object
 2   address       150346 non-null  object
 3   city          150346 non-null  object
 4   state         150343 non-null  object
 5   postal_code   150346 non-null  object
 6   latitude      150346 non-null  object
 7   longitude     150346 non-null  object
 8   stars         150346 non-null  object
 9   review_count  150346 non-null  object
 10  is_open       150346 non-null  object
 11  attributes    136602 non-null  object
 12  categories    150243 non-null  object
 13  hours         127123 non-null  object
dtypes: object(14)
memory usage: 17.2+ MB

In [83]:
df_business.shape

(150346, 14)

In [113]:
df_business.drop_duplicates('business_id',inplace=True)

In [114]:
df_business.shape

(150346, 14)

In [115]:
df_business['categories'] = df_business['categories'].str.split(',')
df_business= df_business.dropna(subset=['categories']) # Elimina datos nulos de la columna

In [116]:
df_business.shape

(150243, 14)

In [117]:
df_business['Es_Restaurant'] = df_business['categories'].apply(lambda x: 'Restaurants' in x)

In [118]:
df_business= df_business[df_business['Es_Restaurant']]
df_business.head(3)

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours,Es_Restaurant
3,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,CA,19107,39.955505,-75.155564,4.0,80,1,"{'RestaurantsDelivery': 'False', 'OutdoorSeati...","[Restaurants, Food, Bubble Tea, Coffee & Te...","{'Monday': '7:0-20:0', 'Tuesday': '7:0-20:0', ...",True
23,9OG5YkX1g2GReZM0AskizA,Romano's Macaroni Grill,5505 S Virginia St,Reno,AB,89502,39.476117,-119.789339,2.5,339,1,"{'RestaurantsGoodForGroups': 'True', 'Restaura...","[Restaurants, Italian]","{'Monday': '11:0-22:0', 'Tuesday': '11:0-22:0'...",True
27,tMkwHmWFUEXrC9ZduonpTg,The Green Pheasant,215 1st Ave S,Nashville,TN,37201,36.159886,-86.773197,4.0,161,0,"{'RestaurantsGoodForGroups': 'True', 'HappyHou...","[Restaurants, Japanese, Seafood]","{'Wednesday': '16:0-22:0', 'Thursday': '16:0-2...",True

In [119]:
df_business.shape

(15290, 15)

In [120]:
df_business= df_business.dropna(subset=['state']) # Elimina datos nulos de la columna
df_business['state']= df_business['state'].str.strip()  # quita los espacios vacios

In [121]:
df_business = df_business.merge(df_estados_USA, on='state', how='left')

In [122]:
df_business= df_business.drop(['state'], axis=1)
df_business= df_business.rename(columns={'estado': 'state'}) # cambiar nombre de la columna
df_business= df_business.dropna(subset=['state']) # Elimina datos nulos de la columna

In [94]:
df_business.shape

(14756, 15)

In [123]:
lista_estados= ['Florida', 'Pennsylvania', 'Tennessee', 'California', 'Texas', 'New York']
df_business= df_business[df_business['state'].isin(lista_estados)]

In [96]:
df_business.head(3)

,business_id,name,address,city,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours,Es_Restaurant,state
0,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,19107,39.955505,-75.155564,4.0,80,1,"{'RestaurantsDelivery': 'False', 'OutdoorSeati...","[Restaurants, Food, Bubble Tea, Coffee & Te...","{'Monday': '7:0-20:0', 'Tuesday': '7:0-20:0', ...",True,California
2,tMkwHmWFUEXrC9ZduonpTg,The Green Pheasant,215 1st Ave S,Nashville,37201,36.159886,-86.773197,4.0,161,0,"{'RestaurantsGoodForGroups': 'True', 'HappyHou...","[Restaurants, Japanese, Seafood]","{'Wednesday': '16:0-22:0', 'Thursday': '16:0-2...",True,Tennessee
3,2xVsWBNFwZOxIOdd9Mwnww,Cheeseburger In Paradise,116 N Pottstown Pike,Exton,19341,40.029962,-75.630607,2.5,20,0,"{'NoiseLevel': 'u'average'', 'HasTV': 'True', ...","[Restaurants, Burgers]",None,True,Pennsylvania

In [124]:
df_category= df_business[['business_id','categories']]
df_category= df_category.explode('categories')
df_category= df_category.dropna(subset=['categories']) # Elimina datos nulos de la columna
df_category['categories']= df_category['categories'].str.strip()    # Elimina los espacios

In [125]:
df_category= df_category.rename(columns={'categories': 'category_name'}) # cambiar nombre de las columnas

In [126]:
df_category.head(3)

              business_id category_name
0  MTSW4McQd7CbVtyjqoe9mw   Restaurants
0  MTSW4McQd7CbVtyjqoe9mw          Food
0  MTSW4McQd7CbVtyjqoe9mw    Bubble Tea

In [127]:
df_atributes= df_business[['business_id','attributes']]

In [128]:
# Funcion para cargar los json a una serie de pandas
def expandir_diccionario(diccionario):
    return pd.Series(diccionario)

In [129]:
# Se concatenas las series al df original
df_expandido = pd.concat([df_atributes, df_atributes['attributes'].apply(expandir_diccionario)], axis=1)
df_expandido.drop('attributes', axis=1, inplace=True)     # Se elimina la columna de MISC
df_atributes= df_expandido

In [130]:
df_atributes = df_atributes[['business_id','RestaurantsDelivery','OutdoorSeating','BusinessAcceptsCreditCards','GoodForKids',
                             'RestaurantsPriceRange2','RestaurantsTakeOut','RestaurantsReservations','HasTV']]

In [131]:
df_atributes= df_atributes.fillna('None')     # Se imputan los valores nulos a 'None'

In [108]:
df_atributes.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7854 entries, 0 to 15289
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   business_id                 7854 non-null   object
 1   RestaurantsDelivery         7854 non-null   object
 2   OutdoorSeating              7854 non-null   object
 3   BusinessAcceptsCreditCards  7854 non-null   object
 4   GoodForKids                 7854 non-null   object
 5   RestaurantsPriceRange2      7854 non-null   object
 6   RestaurantsTakeOut          7854 non-null   object
 7   RestaurantsReservations     7854 non-null   object
 8   HasTV                       7854 non-null   object
dtypes: object(9)
memory usage: 613.6+ KB

In [132]:
df_atributes.head()

,business_id,RestaurantsDelivery,OutdoorSeating,BusinessAcceptsCreditCards,GoodForKids,RestaurantsPriceRange2,RestaurantsTakeOut,RestaurantsReservations,HasTV
0,MTSW4McQd7CbVtyjqoe9mw,False,False,False,None,1,True,None,None
2,tMkwHmWFUEXrC9ZduonpTg,None,False,True,False,None,None,True,False
3,2xVsWBNFwZOxIOdd9Mwnww,False,True,True,True,2,True,None,True
7,uI9XODGY_2_ieTE6xJ0myw,False,True,True,True,2,True,True,True
9,Si6LXSR9gvAbmgO5DzV2cw,False,False,True,True,2,True,True,False

In [106]:
#Borrar Columnas
df_business= df_business.drop(['address','postal_code', 'review_count', 'is_open', 'attributes','categories', 'hours'], axis=1)
df_business= df_business[['business_id','name', 'city', 'state', 'latitude', 'longitude', 'stars']]
df_business['price'] = "SIN DATO"
df_business['platform'] = 2
df_business = df_business.reset_index(drop=True)

In [107]:
df_business.head(3)

,business_id,name,city,state,latitude,longitude,stars,price,platform
0,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,Philadelphia,California,39.955505,-75.155564,4.0,SIN DATO,2
1,tMkwHmWFUEXrC9ZduonpTg,The Green Pheasant,Nashville,Tennessee,36.159886,-86.773197,4.0,SIN DATO,2
2,2xVsWBNFwZOxIOdd9Mwnww,Cheeseburger In Paradise,Exton,Pennsylvania,40.029962,-75.630607,2.5,SIN DATO,2

In [ ]:
def dividir_json_grande(archivo_entrada, num_partes):
    # Contar el número total de líneas/objetos en el archivo JSON
    with open(archivo_entrada, 'r', encoding='utf-8') as archivo:
        total_lineas = sum(1 for _ in archivo)
    
    # Calcular el tamaño de cada parte
    tamaño_parte = total_lineas // num_partes
    if total_lineas % num_partes != 0:
        tamaño_parte += 1

    # Leer y dividir el archivo en partes
    with open(archivo_entrada, 'r', encoding='utf-8') as archivo:
        for i in range(num_partes):
            archivo_salida = f'parte_{i + 1}.json'
            with open(archivo_salida, 'w', encoding='utf-8') as salida:
                salida.write('[')  # Comenzar un array JSON
                for j in range(tamaño_parte):
                    linea = archivo.readline()
                    if not linea:
                        break
                    salida.write(linea.rstrip())
                    if j < tamaño_parte - 1 and not archivo.tell() == total_lineas:
                        salida.write(',')
                salida.write(']')  # Terminar el array JSON
            # Si el archivo original ha terminado, salir del bucle
            if not linea:
                break

# Usar la función para dividir el archivo 'archivo.json' en 10 partes
dividir_json_grande('D:/PROYECTO FINAL/Yelp/review.json', 20)